# 定义字典，并记录数据
my_dict = {"张三":{
                  "部门":"科技部",
                  "工资":3000,
                  "级别":1
                },
            "李四":{
                "部门":"市场部",
                "工资":5000,
                "级别":2
            },
            "王武":{
                "部门":"市场部",
                "工资":7000,
                "级别":3
            },
            "赵六":{
                "部门":"科技部",
                "工资":4000,
                "级别":1
            },
            "钱七":{
                "部门":"市场部",
                "工资":6000,
                "级别":2
            }
           }
print(f"员工升职加薪前的结果：{my_dict}")
# 升职加薪
for name in my_dict:
    if(my_dict[name]["级别"] == 1):
        my_dict[name]["级别"] = 2
        my_dict[name]["工资"] = my_dict[name]["工资"] + 1000

print(f"员工升职加薪后的结果：{my_dict}")